garyPenhook/PyAvrOCD/svd/attiny1617.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC0</name>
      <description>Digital to Analog Converter</description>
      <baseAddress>0x008006A0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DAC Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEN</name>
              <description>Output Buffer Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>DATA Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC1</name>
      <description>Digital to Analog Converter</description>
      <baseAddress>0x008006A8</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DAC Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEN</name>
              <description>Output Buffer Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>DATA Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC2</name>
      <description>Digital to Analog Converter</description>
      <baseAddress>0x008006B0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DAC Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTEN</name>
              <description>Output Buffer Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>DATA Register</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EVSYS</name>
      <description>Event System</description>
      <baseAddress>0x00800180</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xA</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x12</offset>
        <size>0xD</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x22</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ASYNCCH0</name>
          <description>Asynchronous Channel 0 Generator Selection</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCCH0</name>
              <description>Asynchronous Channel 0 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter D0 compare B clear</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter D0 compare A set</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter D0 compare B set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter D0 program event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN0</name>
                  <description>Asynchronous Event from Pin PA0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN1</name>
                  <description>Asynchronous Event from Pin PA1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN2</name>
                  <description>Asynchronous Event from Pin PA2</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN3</name>
                  <description>Asynchronous Event from Pin PA3</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN4</name>
                  <description>Asynchronous Event from Pin PA4</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN5</name>
                  <description>Asynchronous Event from Pin PA5</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN6</name>
                  <description>Asynchronous Event from Pin PA6</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_PIN7</name>
                  <description>Asynchronous Event from Pin PA7</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI</name>
                  <description>Unified Program and debug interface</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC2_OUT</name>
                  <description>Analog Comparator 2 out</description>
                  <value>20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCCH1</name>
          <description>Asynchronous Channel 1 Generator Selection</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCCH1</name>
              <description>Asynchronous Channel 1 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable custom logic LUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable custom logic LUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter D0 compare B clear</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter D0 compare A set</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter D0 compare B set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter D0 program event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN0</name>
                  <description>Asynchronous Event from Pin PB0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN1</name>
                  <description>Asynchronous Event from Pin PB1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN2</name>
                  <description>Asynchronous Event from Pin PB2</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN3</name>
                  <description>Asynchronous Event from Pin PB3</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN4</name>
                  <description>Asynchronous Event from Pin PB4</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN5</name>
                  <description>Asynchronous Event from Pin PB5</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN6</name>
                  <description>Asynchronous Event from Pin PB6</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB_PIN7</name>
                  <description>Asynchronous Event from Pin PB7</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC2_OUT</name>
                  <description>Analog Comparator 2 out</description>
                  <value>19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCCH2</name>
          <description>Asynchronous Channel 2 Generator Selection</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCCH2</name>
              <description>Asynchronous Channel 2 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter D0 compare B clear</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter D0 compare A set</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter D0 compare B set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter D0 program event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN0</name>
                  <description>Asynchronous Event from Pin PC0</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN1</name>
                  <description>Asynchronous Event from Pin PC1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN2</name>
                  <description>Asynchronous Event from Pin PC2</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN3</name>
                  <description>Asynchronous Event from Pin PC3</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN4</name>
                  <description>Asynchronous Event from Pin PC4</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_PIN5</name>
                  <description>Asynchronous Event from Pin PC5</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC2_OUT</name>
                  <description>Analog Comparator 2 out</description>
                  <value>17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
